Repository: 84000/data-translation-memory
Catalog: toh109-v4.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྒྲུབ་པ་རྣམས་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྙེད་དཀའ་བ་མ་ཡིན་ནོ།།
en: Son of good family, unsurpassed, perfect, complete awakening is not difficult to attain for bodhisattva great beings who practice in these ways.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ།།
en: Then, the Bhagavat said to the ever-youthful Mañjuśrī, “Mañjuśrī, you have spoken these words well. Well done! Well done!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: After the Bhagavat had said so, the ever-youthful Mañjuśrī and the world with its gods, humans, asuras, and gandharvas rejoiced, and they praised what was spoken by the Bhagavat.

source: འཕགས་པ་ག་ཡཱ་མགོའི་རི་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།།།
en: This completes the noble Mahāyāna sūtra “Gayāśīrṣa Hill.”

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།།
en: Translated, revised, and finalized by the Indian preceptor Surendrabodhi and the chief editor-translator Bandé Yeshé Dé.
